InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПриглашенияКОбменуЭлектроннымиДокументами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорЭДОКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Ссылка на контрагента информационной базы, соответствующего владельцу идентификатора контрагента, указанного в приглашении. Используется для: 1) заполнения его во входящем произвольном документе в случае, если данные контрагента не указаны в транспортной информации; 2) вывода и фильтрации в списке приглашений; 3) стартового создания настроек отправки/получения при переходе связи в состояние "Принято".</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПриглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ознакомиться</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Для внутренних операций - "КлючПриглашения", для взаимодействия с сервисом - "ВнешнийКод", "ExternalContactId". При отправке широковещательного приглашения не заполняется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьУникальностьПриглашений(Отказ);
	ЗаполнитьОператораЭДОКонтрагента(Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		ОчиститьДублиВСуществующихЗаписях();
	КонецЕсли;

	КонтрагентыИзПриглашений = Новый Массив;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Контрагент) И КонтрагентыИзПриглашений.Найти(Запись.Контрагент) = Неопределено Тогда
			КонтрагентыИзПриглашений.Добавить(Запись.Контрагент);
		КонецЕсли;
	КонецЦикла;

	Если КонтрагентыИзПриглашений.Количество() Тогда
		РаботаСАбонентамиЭДО.ОбновитьСостоянияКонтрагентов(КонтрагентыИзПриглашений);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьПриглашений(Отказ)

	ПроверяемыеПриглашения = Выгрузить( , "Ключ,ИдентификаторОрганизации,ИдентификаторКонтрагента");
	
	// Проверим новые записи
	СвернутыеПриглашения = ПроверяемыеПриглашения.Скопировать();
	КоличествоДо = СвернутыеПриглашения.Количество();
	СвернутыеПриглашения.Свернуть("ИдентификаторОрганизации,ИдентификаторКонтрагента");
	КоличествоПосле = СвернутыеПриглашения.Количество();
	Если КоличествоДо <> КоличествоПосле Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			НСтр(
			"ru = 'В записываемом наборе приглашений есть не уникальные приглашения по идентификаторам организации и контрагента.';
			|en = 'The invitation set being written contains duplicate invitations by company and counterparty IDs.'"));
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОператораЭДОКонтрагента(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.ИдентификаторКонтрагента) Тогда
			Запись.ОператорЭДОКонтрагента = РаботаСАбонентамиЭДОКлиентСервер.ОператорАбонента(Запись.ИдентификаторКонтрагента);
		Иначе
			Запись.ОператорЭДОКонтрагента = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьДублиВСуществующихЗаписях()

	УстановитьПривилегированныйРежим(Истина);

	ПроверяемыеПриглашения = Выгрузить( , "Ключ,ИдентификаторОрганизации,ИдентификаторКонтрагента");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроверяемыеПриглашения.Ключ КАК Ключ,
	|	ПроверяемыеПриглашения.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
	|	ПроверяемыеПриглашения.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента
	|ПОМЕСТИТЬ ВТ_ПроверяемыеПриглашения
	|ИЗ
	|	&ПроверяемыеПриглашения КАК ПроверяемыеПриглашения
	|ГДЕ
	|	ПроверяемыеПриглашения.ИдентификаторОрганизации <> """"
	|	И ПроверяемыеПриглашения.ИдентификаторКонтрагента <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ключ,
	|	ИдентификаторОрганизации,
	|	ИдентификаторКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриглашенияНаИдентификаторы.Ключ КАК КлючСуществующего,
	|	ВТ_ПроверяемыеПриглашения.Ключ КАК КлючЗаписываемого,
	|	ПриглашенияНаИдентификаторы.ИдентификаторОрганизации,
	|	ПриглашенияНаИдентификаторы.ИдентификаторКонтрагента
	|ИЗ
	|	ВТ_ПроверяемыеПриглашения КАК ВТ_ПроверяемыеПриглашения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ПриглашенияНаИдентификаторы
	|		ПО ВТ_ПроверяемыеПриглашения.ИдентификаторОрганизации = ПриглашенияНаИдентификаторы.ИдентификаторОрганизации
	|		И ВТ_ПроверяемыеПриглашения.ИдентификаторКонтрагента = ПриглашенияНаИдентификаторы.ИдентификаторКонтрагента
	|		И ВТ_ПроверяемыеПриглашения.Ключ <> ПриглашенияНаИдентификаторы.Ключ";

	Запрос.УстановитьПараметр("ПроверяемыеПриглашения", ПроверяемыеПриглашения);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ключ.Установить(ВыборкаДетальныеЗаписи.КлючСуществующего);
		НаборЗаписей.Отбор.ИдентификаторОрганизации.Установить(ВыборкаДетальныеЗаписи.ИдентификаторОрганизации);
		НаборЗаписей.Записать();
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
